# Linear Regression

### import libraries

In [4]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt

### Load DataSet

In [5]:
salary_data = pd.read_csv('Salary_Data.csv')

In [6]:
salary_data.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0